{
  "cocktails": [
    {
      "id": 1,
      "name": "Classic Margarita",
      "ingredients": "1 lime wedge, plus 2 lime wheels for garnish, 1 tbsp coarse salt for glass rim, 4 oz blanco tequila, 2 oz Cointreau, 1 1/2 oz fresh juice from 2 limes ",
      "directions": "Rim the glass using lime and salt. Set aside. In a cocktail shaker, combine tequila, Cointreau, and lime juice. Fill with ice and shake until thoroughly chilled, about 15 seconds (the bottom of a metal shaker should frost over).Fill glasses with fresh ice and strain margarita into both glasses. Garnish with lime wheels and serve. ",
      "image": "https://www.seriouseats.com/thmb/uEgkydkRh3KM3d8erZ1lKrFO9tY=/880x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150323-cocktails-vicky-wasik-margarita-c84b154e757d43688de15dc8f8ca0de9.jpg"
    },
    {
      "id": 2,
      "name": "Jalape単o Margarita",
      "ingredients": "Salt and lime wedge to rim the glass, ice, 2oz tequila blanco, 2 tbsp freshly squeezed lime juice, 1 tbsp freshly squeed orange juice, 1 1/2  tsp light agave nectar, 1/2 jalape単o pepper.",
      "directions": "Rim the glass using lime and salt. Set aside. Fill a cocktail shaker with ice. Add the tequila, lime juice, orange juice, agave, and jalape単o slices. Tightly close and shake vigorously for 30 seconds. Fill glasses with ice and strain into the rimmed glass. Garnish with lime wedges and additional jalape単o slices. .",
      "image": "https://www.wellplated.com/wp-content/uploads/2017/05/Spicy-Jalapeno-Margarita-1.jpg"
    },
    {
      "id": 3,
      "name": "Frozen Strawberry-Basil Margarita",
      "ingredients": "1 lime wedge, coarse sugar (optional), 1 1/2 oz blanco tequila, 1 oz triple sec, 1/2 oz freshly squeezed lime juice, 1 cup frozen unsweetened sliced strawberries, 4 basil leaves, fresh strawberries (optional)",
      "directions": "Rim the glass using lime and sugar. Place tequila, triple sec, lime juice, straberries and basil in a blender; cover and process until smooth. Pour into prepared glass. Garnish with lime wedge, strawberries and/or basil leaves",
      "image": "https://www.tasteofhome.com/wp-content/uploads/2021/01/Strawberry-Basil-Frozen-Margarita_EXPS_TOHAM21_257584_E12_08_6b-2.jpg?fit=700,1024"
    },
    {
      "id": 4,
      "name": "Passion Fruit Margarita",
      "ingredients": "2 oz tequila, 1 oz Grand Marnier or Cointreau, 1 oz passion fruit puree, 3/4 oz fresh lime juice, 3/4 oz simple syrup, tajin or salt for the rim, dehydrated lime slices for garnish.",
      "directions": "Rim the glass using lime and tajin. In a cocktail shaker, combine the tequila, grand marnier, passion fruit, lime, and simple syrup with a couple cubes of ice and shake vigorously. Fill glass with ice and strain into the prepared cocktail glass and garnish with a dehydrated lime slice, if desired.",
      "image": "https://somuchfoodblog.com/wp-content/uploads/2020/04/passion-fruit-marg6.jpg"
    }
  ]
}